Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidStartLevel Property
 The start level and end level for this staircase must be at different elevations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidStartLevel { get; }
Public Shared ReadOnly Property InvalidStartLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidStartLevel {
	FailureDefinitionId^ get ();
}
static member InvalidStartLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace